[
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "طريقة الشرح وطريقة تفاعلنا مع اللي بيشرح اكتر حاجة انا شايفها مفيدة في الكورس اعتقد دي بتفرق جدا في فهم اي ع الرغم ان ساعات بيبقي في حاجات صعبة بس مع كتر الاسئلة الواحد بيفهم يعني تاني افضل حاجة هي ال topic homeworks كورس مفيد جدا جدا جدا مادة علمية قوية تجربة فريدة سعيد جدا جدا بيها احساس انك بتحضر لايف حتى لو متسجل مع توفير الوقت offline كأنه بالظبط حضور ds&algo اعتقد لو حد عايز يبدأ كورس دى بداية قوية جدا جدا جدا معتقدش هيحتاج حاجات كتير زيادة ف من وجهة نظري يتسحق جدا جدا جدا الفلوس المدفوعة أعلى تقييم ويستحق",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️",
    "text": "Good: بالنسبالي أنا بتعلم طريقة تفكير قبل ما بتعلم محتوى الكورس نفسه جدا الموضوع ده مهم (طريقة التفكير ) الأمثلة اللي الدكتور بيقول عليها بتفرق أمثلة في الحياة العملية ده برده حاجة كويسة بتعرف من خلالها الحاجة اللي أنت بدرسها فايدتها أي والأهم بقى لما الدكتور بقى بيحل معانا يااااه بجد الموضوع ده فرق جدًا منها بكتسب أول حاجة أنا قولتها ومنها بتشوف تفكير الناس اللي معاك وفي الآخر طريقة الدكتور وهو بيحاول يوصل للحل Bad: في بعض الأجزاء بتاخد وقت كبير من المحاضرة أسئلة الطلبة في منها مكرر ممكن كذا واحد يسأل اللي زميله بيسأل فيه",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "The course is intensive and has a lot of practice problems. This is essential for learning data structures and algorithms, as it gives you the opportunity to apply what you're learning and to make sure you understand the concepts. The instructor is engaging and provides a lot of opportunities for questions and discussion. This helps to keep the material interesting and to ensure that everyone is on the same page. The instructor provides sessions on solving LeetCode questions which are being used in the interviews. This is incredibly valuable, as it gives you a head start on preparing for your job interviews. The course has a lot of practice problems with high-quality explanations. This is essential for mastering the material.",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "I'm gonna talk about some stuff that has improved in me during this course: - Great understanding of recursion and how to thing of recursive solutions - Abstract thinking skills - How to start thinking of a problem - How to make a decision whether to use this design or this design in your data structure according to its benefits and drawbacks and your criteria - The importance of splitting problems into small tasks (functions) to make code more readable. - Testing code efficiency in terms of space (I knew time complexity before but it was included also in the course). - Enhancements in debugging skills",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "مبدأيا كورس الداتا استركشر والالجورزم لو حد عاوز يقيم كورس بيقيمة كن من خلال حاجات كتيرة بس خصوصاً في وطريقته في الشرح وهوا instructor أولا فهمك للمادة اللى بتتشرح ودا له أسباب كتيرة منها computer science مجال| بيوصل المعلومة ازاى و مدى عمق المعلومات ثانياً التطبيق على محتوى الكورس نرجع لموضوعنا دكتور مصطفى حرفياً انا مكنتش متوقع كدا الصراحة حاجة في منتهى العظمة في الشرح منظم جدا وبيكون فى تفاعل كبير منه معا الطلبة ويخليك تناقشه ومحاور جيد ومبيملش من كتر الاسئلة بل بالعكس بيجاوب على كل الاسئلة بأريحية كبيرة لحد ميتأكد انك فهمت ثانيا التطبيق ودى اكتر حاجة الصراحة ميختلفش عليها اتنين في كورسات دكتور مصطفى واكتر حاجة بحسها مستمتع جدا وانا قبل الكورس كنت حليت 4 مسائل على DSA عظمة الصراحة انابكتب الكلام دا وأنا لسه في كورس course live دلوقتی حالل اکثر من 75 مسألة ولسة فى تلت الكورس انا متفائل جدا الصراحة واللی محضرش leetcode مع دكتور مصطفى سعد فايته كتير الصراحة دكتور مصطفى سعد عظمة",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "طريقة الشرح وطريقة تفاعلنا مع اللي بيشرح اكتر حاجة انا شايفها مفيدة في الكورس اعتقد دي بتفرق جدا في فهم اي ع الرغم ان ساعات بيبقي في حاجات صعبة بس مع كتر الاسئلة الواحد بيفهم يعني تاني افضل حاجة هي ال topic homeworks",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️",
    "text": "في الاول كنت خايف من انه مش هيبقى في فرق بين الدورة و كورسات يوديمي بتاعت حضرتك بس اللي اكتشفته انه الفرق كبير جدا في الفهم والإستفادة لأنه الشرح لايف و أسئلة الشباب اللي حضرتك بتجاوبها بتفهم جدا دا غیر فقرات الحل على يوديمي و كدا فا الصراحة الحمدلله خوفي مكانش في محله خالص و الدورة مفيدة جدا جدا حاجة كمان نسيت اقولها في الفيدباك اللي فات و هي اني بقالي كذا سيشن مش بحضر لايف وبشوف المتسجل بسبب ظروف عندي في المواعيد بس الحمدلله اسئلة الشباب قايمة بالواجب وزيادة ان شاء الله اقدر ارجع احضر لایف قریب رغم اني الصراحة مستريح كدا",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "The course was explained well and clear and has very good concepts",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "الشرح و المتابعة و استقبال الاسئلة و التفاعل مميز جدا ربنا يبارك ف حضرتك يا دكتور ، و مفيش اي ملاحظات",
    "expandable": true,
    "language": "ar"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "Awesome course to be understand and qualified to pass Ds & algorithm in interviews",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "I benefited a lot from the course, it increased my problem-solving skill. The explanation is clear and detailed",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️",
    "text": "Clear explanations helped me understand better, practicing exercises improved my skills. Personally, I think it would be even better if the course time could be a bit earlier. Some of us, including myself, have morning jobs. But other than that, I would rate it 10/10 and definitely recommend it. Thanks for everything!",
    "expandable": true,
    "language": "en"
},
{
    "name": "Anonymous",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "The course is very excellent, as it contains basics in computer science, the science of data structures and algorithms, the systematic gradation of topics from the simplest to the most difficult, etc., and the link between data structure topics, and this is what you find in other courses. Thank you, our doctor, Mostafa Saad",
    "expandable": true,
    "language": "en"
}
]