[
    {
        "name": "Tasneem Sdet",
        "title": "Student",
        "photo": "",
        "rating": "⭐️⭐️⭐️⭐️⭐️",
        "text": "تجربه رائعه وعميقه الأثر على المهارات التكنكال والشخصية كمان بالنسبه لي كانت استجابة لدعاء ان الله ييسرلي الطريق ويرزقني من يهديني الطريق ثم الأخذ بالأسباب \" د. مصطفى سعد كنز من كنوز المجال في مصر والوطن العربي اسأل الله ان يعينه ويسدد خطاه وویزیده من فضله وعلمه ويهون عليه طريق تعليم الاجيال ونصحهم بما فيها من اعباء واسال الله ان يستخدمه ما يستبدله ياذن الله من حقيقي مافيش كلام يقدر يوفي حقه في التقدير او تزكيته علما وخلقا وتمكن مجاله واخلاصه في توصيل المعلومه او تقديم النصيحه المصحوب بتواضع وكرم أخلاق... جزاه الله كل خير يارب وربنا يزيده من علمه وينفع بيه باذن الله الي شايف نفسه في توهه وتوهان طالب / خريج في المجال بس مجرد عداد سنوات بدون اساسيات عميقة او خبره قوية وحابب يصحح المسار والأهم مستعد يتعلم ويبذل جهد المطلوب وبس بيدور على حد ثقه يتعلم منه ويكون عنده القدره على توصيل المعلومه بطريقه بسيطه وسهله و منظمه ومرتبه والاهم \"صحيحه\"وباخلاص\" من واقع خبره حقيقه واجتهاد علمي واضح تصيب الهدف بدون توهان میفکرش ثانیه ويضيع وقته او فلوسه في مصادر تانيه ... بصراحه انا بستغرب في جروبات المجال لما بيدخلوا الناس بتسال على كورسات وقدامهم كنز زيد مصطفى سعد ومن قلبه عايز يساعد الناس وتروح لاختيارت تانیه ممکن تضرهم اکثر ما تنفعهم ! خالص الشكر والتقدير وربنا يارب يجازيك كل الخير يارب انا بعتذر اني اتاخرت على الفيدباك كان نفسي اخلص المذاكره والتدريبات الجهد المطلوب مني ولظروف عندي اتأخرت ) لكن إن شاء الله هنزل فيدباك غير دي كمان كاملة أول ما أخلص مذاكرة وتطبيقات الكورس كله وباذن الله ناويه وربنا يقدرني اكمل واخد كورس الداتاستركشر والالجورثم وال ML",
        "expandable": true,
        "language": "ar"
    },
    {
    "name": "Mohamed Ahmed Farg",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "من أفضل التجارب عندى وأنصح بيها اى حد عايز يفهم ويكون كويس في البرمجه الدكتور بيأسسك صح بس ما عليك الا الالتزام والصبر والاجتهاد من أحسن القرارات اللى اخدتها في حياتي الدوره كانت وافيه وكامله والدكتور ربنا يخليه ما قصر الدكتور فعلا بيأثر فيك كمستوى اخلاقى و تعلیمی و اجتماعی ونفسى انا ممتن ليه وان شاء الله مكمل في دوره Data structure and Algorithm",
    "expandable": true,
    "language": "ar"
    },
    {
    "name": "Ahmed Halim",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "تجربة جميلة ومشجعة ربنا يجازي حضرتك كل خير، ومناسبة خاصةً لو حد بيسأل كتير أو حد محتاج يكون في نظام ومجموعة ،ونقاش بدل الكورس الاونلاين المسجل اللي غالبا العملية فيه صامتة أو راكدة، وإن شاء الله هنزل فيدباك كاملة أول ما أخلص مذاكرة الكورس كله، وأتمنى حضرتك تكمل التجربة الجميلة ديه لحد آخر مستوى ممكن وربنا يزيدكم علما ونفعًا يا رب :)",
    "expandable": true,
    "language": "ar"
    },
    {
    "name": "Abdulrahman Ahmed",
    "title": "Student",
    "photo": "",
    "rating": "⭐️⭐️⭐️⭐️⭐️",
    "text": "كان ليا اكتر من تجربة في كورسات online و offline ده الكورس الوحيد اللى فعلاً مادته العلمية محترمة جداً كمان دسمة شويتين ( محتاجة مذاكرة الدكتور جزاه الله خيراً صبور جداً في الأسئلة وممكن يعيد أكتر من مرة خلال السشن الواحدة يكرر سؤاله لو فى حد مش فاهم أو في نقاط مش واضحة الدكتور بيشجع دايماً على الأسئلة دائماً يقولك فى الماركت (السوق) اعمل كده ومتعملش كده لو فى حاجة مش واضحة خلال الكورس كان بنعمل سشن إضافي لتوضيحه أفضل كورس أخدته نسأل الله أن ينفعنا به ويبارك في جهد الدكتور وإتقانه بس الكورس محتاج مذااااااكرة",
    "expandable": true,
    "language": "ar"
    }
]